app/controllers/pictures_controller.rb

	def create
		@picture = Picture.new(picture_params)
		if @picture.save
---
INSERT INTO "pictures" ("name", "description", "owner", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"